product/load-test/results/scenario1-lock/after/run3/warmup.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /Users/ann/Programming/Java Projects/hub-eleven/product/load-test/scripts/scenario1-stock-decrease-lock.js
        output: -

     scenarios: (100.00%) 1 scenario, 10 max VUs, 50s max duration (incl. graceful stop):
              * warmup: 10 looping VUs for 30s (gracefulStop: 20s)

time="2026-08-05T17:54:37+09:00" level=info msg="초기 재고: 100000000" source=console

running (01.0s), 10/10 VUs, 103 complete and 0 interrupted iterations
warmup   [   3% ] 10 VUs  00.9s/30s

running (02.0s), 10/10 VUs, 237 complete and 0 interrupted iterations
warmup   [   6% ] 10 VUs  01.9s/30s

running (03.0s), 10/10 VUs, 356 complete and 0 interrupted iterations
warmup   [  10% ] 10 VUs  02.9s/30s

running (04.0s), 10/10 VUs, 510 complete and 0 interrupted iterations
warmup   [  13% ] 10 VUs  03.9s/30s

running (05.0s), 10/10 VUs, 700 complete and 0 interrupted iterations
warmup   [  16% ] 10 VUs  04.9s/30s

running (06.0s), 10/10 VUs, 906 complete and 0 interrupted iterations
warmup   [  20% ] 10 VUs  05.9s/30s

running (07.0s), 10/10 VUs, 1108 complete and 0 interrupted iterations
warmup   [  23% ] 10 VUs  06.9s/30s

running (08.0s), 10/10 VUs, 1321 complete and 0 interrupted iterations
warmup   [  26% ] 10 VUs  07.9s/30s

running (09.0s), 10/10 VUs, 1548 complete and 0 interrupted iterations
warmup   [  30% ] 10 VUs  08.9s/30s

running (10.0s), 10/10 VUs, 1766 complete and 0 interrupted iterations
warmup   [  33% ] 10 VUs  09.9s/30s

running (11.0s), 10/10 VUs, 1960 complete and 0 interrupted iterations
warmup   [  36% ] 10 VUs  10.9s/30s

running (12.0s), 10/10 VUs, 2163 complete and 0 interrupted iterations
warmup   [  40% ] 10 VUs  11.9s/30s

running (13.0s), 10/10 VUs, 2387 complete and 0 interrupted iterations
warmup   [  43% ] 10 VUs  12.9s/30s

running (14.0s), 10/10 VUs, 2592 complete and 0 interrupted iterations
warmup   [  46% ] 10 VUs  13.9s/30s

running (15.0s), 10/10 VUs, 2752 complete and 0 interrupted iterations
warmup   [  50% ] 10 VUs  14.9s/30s

running (16.0s), 10/10 VUs, 2911 complete and 0 interrupted iterations
warmup   [  53% ] 10 VUs  15.9s/30s

running (17.0s), 10/10 VUs, 3102 complete and 0 interrupted iterations
warmup   [  56% ] 10 VUs  16.9s/30s

running (18.0s), 10/10 VUs, 3299 complete and 0 interrupted iterations
warmup   [  60% ] 10 VUs  17.9s/30s

running (19.0s), 10/10 VUs, 3497 complete and 0 interrupted iterations
warmup   [  63% ] 10 VUs  18.9s/30s

running (20.0s), 10/10 VUs, 3682 complete and 0 interrupted iterations
warmup   [  66% ] 10 VUs  19.9s/30s

running (21.0s), 10/10 VUs, 3893 complete and 0 interrupted iterations
warmup   [  70% ] 10 VUs  20.9s/30s

running (22.0s), 10/10 VUs, 4079 complete and 0 interrupted iterations
warmup   [  73% ] 10 VUs  21.9s/30s

running (23.0s), 10/10 VUs, 4268 complete and 0 interrupted iterations
warmup   [  76% ] 10 VUs  22.9s/30s

running (24.0s), 10/10 VUs, 4456 complete and 0 interrupted iterations
warmup   [  80% ] 10 VUs  23.9s/30s

running (25.0s), 10/10 VUs, 4654 complete and 0 interrupted iterations
warmup   [  83% ] 10 VUs  24.9s/30s

running (26.0s), 10/10 VUs, 4838 complete and 0 interrupted iterations
warmup   [  86% ] 10 VUs  25.9s/30s

running (27.0s), 10/10 VUs, 4979 complete and 0 interrupted iterations
warmup   [  90% ] 10 VUs  26.9s/30s

running (28.0s), 10/10 VUs, 5113 complete and 0 interrupted iterations
warmup   [  93% ] 10 VUs  27.9s/30s

running (29.0s), 10/10 VUs, 5294 complete and 0 interrupted iterations
warmup   [  96% ] 10 VUs  28.9s/30s

running (30.0s), 10/10 VUs, 5395 complete and 0 interrupted iterations
warmup   [ 100% ] 10 VUs  29.9s/30s
time="2026-08-05T17:55:07+09:00" level=info msg="초기 재고: 100000000" source=console
time="2026-08-05T17:55:07+09:00" level=info msg="최종 재고: 99994590" source=console
time="2026-08-05T17:55:07+09:00" level=info msg="차감된 수량: 5410" source=console
time="2026-08-05T17:55:07+09:00" level=info msg="차감된 수량이 summary의 stock_decrease_successes count와 일치하는지 확인하세요" source=console


  █ THRESHOLDS 

    http_req_failed
    ✓ 'rate==0' rate=0.00%

    stock_unexpected_failures
    ✓ 'count==0' count=0


  █ TOTAL RESULTS 

    checks_total.......: 5410    178.276909/s
    checks_succeeded...: 100.00% 5410 out of 5410
    checks_failed......: 0.00%   0 out of 5410

    ✓ 차감 성공 또는 락 타임아웃

    CUSTOM
    stock_decrease_successes........: 5410   178.276909/s
    stock_lock_timeout_rate.........: 0.00%  0 out of 5410
    stock_unexpected_failure_rate...: 0.00%  0 out of 5410
    stock_unexpected_failures.......: 0      0/s

    HTTP
    http_req_duration...............: avg=55.4ms  min=7.52ms  med=48.7ms  max=426.44ms p(90)=71.37ms p(95)=86.66ms p(99)=138.38ms
      { expected_response:true }....: avg=55.4ms  min=7.52ms  med=48.7ms  max=426.44ms p(90)=71.37ms p(95)=86.66ms p(99)=138.38ms
    http_req_failed.................: 0.00%  0 out of 5412
    http_reqs.......................: 5412   178.342816/s

    EXECUTION
    iteration_duration..............: avg=55.55ms min=40.09ms med=48.85ms max=426.6ms  p(90)=71.52ms p(95)=86.79ms p(99)=138.68ms
    iterations......................: 5410   178.276909/s
    vus.............................: 10     min=10        max=10
    vus_max.........................: 10     min=10        max=10

    NETWORK
    data_received...................: 3.2 MB 106 kB/s
    data_sent.......................: 1.1 MB 35 kB/s



running (30.3s), 00/10 VUs, 5410 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 10 VUs  30s